{
  "recipes": [
    {
      "id": "01",
      "title": "Deep-Sea Blowfish",
      "servings": "2 as a starter",
      "src": "",
      "ingredients": [
        {
          "name": "deep-sea blowfish",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "sea bream or other white fish, absolutely fresh, filleted",
          "src": "",
          "quantity": "50",
          "unit": "g"
        },
        {
          "name": "radishes",
          "src": "",
          "quantity": "3-4"
        },
        {
          "name": "spring onions",
          "src": "",
          "quantity": "2-3"
        },
        {
          "name": "watercress",
          "src": "",
          "quantity": "a few sprigs"
        },
        {
          "name": "light soy sauce",
          "src": "",
          "quantity": "an eggcup full"
        },
        {
          "name": "mustard",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "lemon juice",
          "src": "",
          "quantity": "2",
          "unit": "teaspoons"
        },
        {
          "name": "garlic, crushed",
          "src": "",
          "quantity": "1",
          "unit": "clove"
        }
      ],
      "instructions": "THE MOST IMPORTANT thing here is not to use any of the blowfish whatsoever, since every single part of it is deadly in a very unpleasant way. After covering all work surfaces, dispose of the blowfish very carefully. Better yet, get someone else to dispose of the blowfish, preferably someone you don't like very much but who doesn't owe you any money. An incinerator would be an ideal place, provided the smoke is blowing in the direction of unnecessary people. Check the fish for any scales or bones and remove any you find. Place in a colander and quickly pour boiling water over it, then immediately plunge the fish into a bowl of cold water; the object is not to cook it but to make sure it is clean. Finely slice the radishes and spring onion (lengthways) and arrange into pretty patterns on two plates, along with the watercress. Using a very sharp knife, carefully slice the fish as thinly as possible. Serve immediately, with the soy dip.",
      "notes": "You might ask why bother to obtain a deep-sea blowfish at all? If you do not, the dish will still be very pleasant but will not have that delicate frisson which lifts the dish to gastronomic heaven. Connoisseurs claim they can tell by the taste if a blowfish has been anywhere near the kitchen on the day of preparation. Some wizards reckon that the blowfish business is a bit like that idea that water remembers what's been in it. People know the dish is a genuine blowfish dish when they've been charged $100 for it."
    },
    {
      "id": "02",
      "title": "Bananana Soup Surprise",
      "src": "",
      "servings": "4",
      "ingredients": [
        {
          "name": "large bananas, peeled",
          "src": "",
          "quantity": "4"
        },
        {
          "name": "vegetable stock",
          "src": "",
          "quantity": "470",
          "unit": "ml"
        },
        {
          "name": "dry sherry",
          "src": "",
          "quantity": "155",
          "unit": "ml"
        },
        {
          "name": "ground nutmeg",
          "src": "",
          "quantity": "1",
          "unit": "heaped teaspoon"
        },
        {
          "name": "brown sugar",
          "src": "",
          "quantity": "1",
          "unit": "heaped teaspoon"
        },
        {
          "name": "chopped chervil",
          "src": "",
          "quantity": "2",
          "unit": "heaped teaspoons"
        },
        {
          "name": "salt",
          "src": "",
          "quantity": "pinch"
        },
        {
          "name": "pepper",
          "src": "",
          "quantity": "pinch"
        },
        {
          "name": "lemon juice",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        }
      ],
      "instructions": "CHOP TWO OF the bananas and put into a pan with the stock. Blend or mash until the bananas are smooth and well blended. Slowly bring the liquid to simmering point, taking care not to let it boil, and add the remaining ingredients. Stir gently for 2–3 minutes to ensure that all the sugar has dissolved and leave to simmer for a further 5 minutes, stirring frequently. Take the remaining two bananas and chop them in half width-ways. Place each half in a bowl, pointing upwards. Pour in some soup and serve. Surprising, eh?",
      "notes": "Some special ingredients have been left out from the original recipe as they made the soup a bit too surprising."
    },
    {
      "id": "03",
      "title": "Celery Astonishment",
      "src": "",
      "servings": "2",
      "ingredients": [
        {
          "name": "large head of celery",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "cooked rice",
          "src": "",
          "quantity": "300",
          "unit": "g"
        },
        {
          "name": "green pepper, seeded and chopped",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "tomatoes, chopped",
          "src": "",
          "quantity": "3"
        },
        {
          "name": "grated Parmesan cheese",
          "src": "",
          "quantity": "60",
          "unit": "g"
        },
        {
          "name": "lemon juice",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "chopped tarragon",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon"
        },
        {
          "name": "egg, beaten",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "salt",
          "src": "",
          "quantity": "to taste"
        },
        {
          "name": "pepper",
          "src": "",
          "quantity": "to taste"
        }
      ],
      "instructions": "PREHEAT THE OVEN to 200°C/Gas 6. Prepare the celery by carefully removing the inner stalks, any leaves, mud, etc., to form a hollow. Mix together all the remaining ingredients except the egg, and check seasoning. Bind together with the egg. Take a large piece of lightly oiled cooking foil and place it on a baking tray. Place the celery on the foil and stuff it with the mixture. Tie with string around the loose ends to prevent the stuffing falling out, wrap in the foil, and bake in the oven for 1¼–2 hours until celery is tender. To serve, carefully unwrap and place on an oval serving platter with two judiciously placed baked potatoes, mayhap. Carve at the table.",
      "notes": "The recipe originally included aubergine, but it was removed because it caused some amusement."
    },
    {
      "id": "04",
      "title": "Primal Soup",
      "servings": "4 as a main course or 6 as a starter",
      "src": "",
      "ingredients": [
        {
          "name": "fish stock",
          "src": "",
          "quantity": "470",
          "unit": "ml"
        },
        {
          "name": "salmon, filleted and skinned",
          "src": "",
          "quantity": "50",
          "unit": "g"
        },
        {
          "name": "cod, filleted and skinned",
          "src": "",
          "quantity": "50",
          "unit": "g"
        },
        {
          "name": "mussels, shelled and cleaned",
          "src": "",
          "quantity": "12"
        },
        {
          "name": "crab meat (prepared) or crab sticks, roughly shredded",
          "src": "",
          "quantity": "50",
          "unit": "g"
        },
        {
          "name": "baby octopus tentacles, cleaned",
          "src": "",
          "quantity": "6-10"
        },
        {
          "name": "tin chopped tomatoes",
          "src": "",
          "quantity": "230",
          "unit": "g"
        },
        {
          "name": "dry white wine",
          "src": "",
          "quantity": "150",
          "unit": "ml"
        },
        {
          "name": "garlic, crushed",
          "src": "",
          "quantity": "2-3",
          "unit": "cloves"
        },
        {
          "name": "parsley, roughly chopped",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon"
        },
        {
          "name": "dill, chopped",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon"
        },
        {
          "name": "paprika",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "vermicelli nests",
          "src": "",
          "quantity": "2",
          "unit": "nests (approx. 25g each)"
        },
        {
          "name": "shrimps, shelled and cooked",
          "src": "",
          "quantity": "100",
          "unit": "g"
        },
        {
          "name": "gravy browning/green food dye (optional)",
          "src": "",
          "quantity": "a few drops"
        },
        {
          "name": "egg, beaten",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "salt",
          "src": "",
          "quantity": "to taste"
        },
        {
          "name": "pepper",
          "src": "",
          "quantity": "to taste"
        }
      ],
      "instructions": "HEAT THE FISH stock in a large pan. Roughly chop the salmon and cod and drop into the stock. Simmer on a gentle heat until the fish is nearly cooked. Then remove from the heat and stir until the fish chunks separate and break down. Return to the heat and add the mussels, crab meat and tentacles. Bring to a simmer. Add the tomatoes and wine and return to a low heat. Add the herbs, garlic and seasonings, the vermicelli and shrimps, and simmer until the pasta cooks. Add browning/food dye if required, and check seasoning. Finally, add the egg and gently stir until cooked. Then quickly bring the mixture to the boil for a few seconds and serve.",
      "notes": "A popular dish at Unseen University and, it is rumoured, among the gods themselves. It is said to be the soup from which all life evolved, and if you leave this one long enough life will definitely evolve in it."
    },
    {
      "id": "05",
      "title": "Mrs Colon's Genyooin Klatchian Curry",
      "servings": "4",
      "src": "",
      "ingredients": [
        {
          "name": "sunflower oil",
          "src": "",
          "quantity": "2",
          "unit": "tablespoons"
        },
        {
          "name": "large onion, roughly chopped",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "garlic, chopped",
          "src": "",
          "quantity": "2",
          "unit": "cloves"
        },
        {
          "name": "peas (frozen will be fine)",
          "src": "",
          "quantity": "225",
          "unit": "g"
        },
        {
          "name": "red pepper, seeded and chopped",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "green pepper, seeded and chopped",
          "src": "",
          "quantity": "1"
        },
        {
          "name": "curry powder (optional, for old time's sake)",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "ground turmeric",
          "src": "",
          "quantity": "½",
          "unit": "teaspoon"
        },
        {
          "name": "coconut milk",
          "src": "",
          "quantity": "175",
          "unit": "ml"
        },
        {
          "name": "swede, chopped and boiled until just tender",
          "src": "",
          "quantity": "350",
          "unit": "g"
        },
        {
          "name": "broccoli florets",
          "src": "",
          "quantity": "225",
          "unit": "g"
        },
        {
          "name": "raisins or sultanas",
          "src": "",
          "quantity": "50",
          "unit": "g"
        },
        {
          "name": "ground ginger",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "ground cumin",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "ground coriander",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "vegetable stock",
          "src": "",
          "quantity": "250",
          "unit": "ml"
        },
        {
          "name": "tomato purée to thicken, if needed",
          "src": "",
          "quantity": "as needed"
        },
        {
          "name": "brown mustard seeds",
          "src": "",
          "quantity": "2",
          "unit": "teaspoons"
        },
        {
          "name": "salt",
          "src": "",
          "quantity": "to taste"
        },
        {
          "name": "black pepper",
          "src": "",
          "quantity": "to taste"
        }
      ],
      "instructions": "PREHEAT THE OVEN to 180°C/Gas 4. Heat the oil in a large frying pan. Add the onion, garlic, broccoli, peppers and cook until the onion starts to soften. Then add the part-cooked swede, the peas and raisins and cook gently for a further 5 minutes. Add the spices (but not the mustard seeds), the coconut milk and about half the vegetable stock. Cook for a further 10 minutes or so, adding extra stock if the mixture needs it. If it seems too runny, add a little tomato purée to thicken. Transfer the mixture to a casserole dish, season, sprinkle with the mustard seeds, cover and cook in the oven for about 45 minutes. Serve with rice or nan bread. Run away.",
      "notes": "A note from the editors: Few recipes in these pages have caused so much debate as this one. Anyone over the age of forty knows how the classic recipe goes, because it has been invented and reinvented thousands of times by ladies who have heard about foreign parts but have no wish to bite into them. Its mere existence is a telling argument for a liberal immigration policy. Like real curry, it includes any ingredients that are to hand. The resemblance stops there, however. It must use bright green peas, lumps of swede and, for the connoisseur of gastronomic history, watery slivers of turnip. For wateriness is the key to this curry; its 'sauce' should be very thin and of an unpleasant if familiar colour. And it must use a very small amount of 'curry powder', a substance totally unknown in those areas where curry grows naturally, as it were; sometimes it's enough just to take the unopened tin out of the pantry and wave it vaguely over the pan. Oh, and remember that the sultanas must be yellow and swollen. And soggy. And sort of gritty, too (ah, you remember …)"
    },
    {
      "id": "06",
      "title": "Wow-Wow Sauce",
      "src": "Ridcully family recipe",
      "servings": "Makes enough for a large roast beef",
      "ingredients": [
        {
          "name": "butter",
          "src": "",
          "quantity": "1",
          "unit": "lump (about the size of an egg)"
        },
        {
          "name": "plain flour",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon"
        },
        {
          "name": "beef stock",
          "src": "",
          "quantity": "300",
          "unit": "ml"
        },
        {
          "name": "English mustard",
          "src": "",
          "quantity": "1",
          "unit": "teaspoon"
        },
        {
          "name": "white wine vinegar",
          "src": "",
          "quantity": "1",
          "unit": "dessertspoon"
        },
        {
          "name": "port",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon"
        },
        {
          "name": "mushroom concentrate",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon"
        },
        {
          "name": "salt and black pepper",
          "src": "",
          "quantity": "",
          "unit": "to taste"
        },
        {
          "name": "freeze-dried parsley",
          "src": "",
          "quantity": "1",
          "unit": "heaped tablespoon"
        },
        {
          "name": "pickled walnuts",
          "src": "",
          "quantity": "4",
          "unit": "chopped"
        }
      ],
      "instructions": "Melt the butter in a saucepan. Stir in the flour and work in the beef stock. Stir continuously on a moderate heat until you have a smooth, thick sauce. Add the mustard, the wine vinegar, the port and the mushroom concentrate. Season with salt and pepper, and continue to cook the mixture for about 10 minutes. Stir in the parsley and the walnuts, warm through and serve.",
      "notes": "The recipe for Wow-Wow Sauce is a hereditary possession of the Ridcully family. Archchancellor Ridcully, like most wizards, is a man who goes for sauces. If you are the kind of person who takes a beefy patty between two halves of a bun and then covers it with cheese, and a pickle, and some green relish, and some red relish, and a different sort of pickle, and then some dark mustard, not forgetting of course some light mustard, and then some bits of green and other things until the meat slides out unnoticed and falls onto the floor, then you are of a magical inclination. A wizard will lick the top of a sauce bottle if he thinks no one is watching. This is of course not genuine Wow-Wow Sauce, which can be made only under carefully controlled conditions and is at its best when on the point of explosively disintegrating. Even shaking the bottle is inviting catastrophe, and only a fool would risk smoking an after-dinner cigar if Wow-Wow Sauce had been on the table. When a bottle of five-year-old sauce was found in the pantry at UU, the entire wing was evacuated for two days until it could be disposed of in a controlled dinner. This sauce, when added to roast beef, will make the steer glad it went to all that trouble."
    },
    {
      "id": "07",
      "title": "Knuckle Sandwich",
      "src": "Ankh-Morpork traditional recipe",
      "servings": "Makes 2 sandwiches",
      "ingredients": [
        {
          "name": "pig's trotters",
          "src": "",
          "quantity": "2",
          "unit": ""
        },
        {
          "name": "bouquet garni",
          "src": "",
          "quantity": "1",
          "unit": ""
        },
        {
          "name": "mustard seeds",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon"
        },
        {
          "name": "butter or olive oil (or garlic butter/garlic olive oil)",
          "src": "",
          "quantity": "",
          "unit": ""
        },
        {
          "name": "pain rustique or other crusty rolls",
          "src": "",
          "quantity": "",
          "unit": ""
        },
        {
          "name": "fresh cress or thinly sliced cucumber",
          "src": "",
          "quantity": "",
          "unit": ""
        }
      ],
      "instructions": "Place the trotters in a pan with the bouquet garni and the mustard seeds. Cover with water and bring to the boil. Simmer until the meat is tender (35–45 minutes, depending on size). Remove from the pan and shake off any excess water. To make the sandwiches, remove the meat from the bone, brush lightly with the butter or oil and grill until golden brown and crispy. Arrange neatly in a split pain rustique with a little fresh cress or wafer-thin sliced cucumber.",
      "notes": "It's amazing what people will eat. No one who was hungry would want to eat a plate of winkles – you could die before you worked out how to twiddle the pin properly. And when you think of all the good bits there are to eat on a pig, the feet wouldn't probably be in the first ten. But when Ankh-Morpork people are far from home, there are things – like falling into an open sewer, or being eaten by cockroaches – that make them think of home. A proper knuckle sandwich is one of them, too. It's poor man's food, 'cos the rich man has eaten the rest of the pig. And the motto is: always wangle a dinner invitation from the rich man."
    },
    {
      "id": "08",
      "title": "Nobby's Mum's Distressed Pudding",
      "src": "Mrs Maisie Nobbs of Old Cobblers, Ankh-Morpork",
      "servings": "Serves 4",
      "ingredients": [
        {
          "name": "white bread",
          "src": "",
          "quantity": "4",
          "unit": "slices (crusts cut off)"
        },
        {
          "name": "black treacle",
          "src": "",
          "quantity": "1",
          "unit": "tablespoon (mixed with 2 tablespoons golden syrup)"
        },
        {
          "name": "golden syrup",
          "src": "",
          "quantity": "2",
          "unit": "tablespoons (mixed with 1 tablespoon black treacle)"
        },
        {
          "name": "stewed prunes",
          "src": "",
          "quantity": "20",
          "unit": "(stoned)"
        },
        {
          "name": "rice pudding",
          "src": "",
          "quantity": "425",
          "unit": "g"
        }
      ],
      "instructions": "Preheat the oven to 180°C/Gas 4. Grease a deep pie dish (roughly 20cm x 12cm). Place two slices of bread in the bottom of the dish and drizzle over a little of the treacle/syrup mix. Spoon over half the rice pudding and top with half the prunes. Repeat the process with the remaining bread, rice pudding and prunes, and top with another drizzle of treacle/syrup. Bake in the top of the oven for 30 minutes or until golden brown.",
      "notes": "I takes off my hat to Mrs Maisie Nobbs of Old Cobblers, Ankh-Morpork, who is the mother of the famous or at any rate notorious Cpl Nobby Nobbs of the City Watch. It's a lot harder to be a good cook in a big industrial city, because in the country there's usually more stuff available – as we say, you can bake it, fry it or boil it, but for choice you poach it. In the city, what you eat is mainly sugar, starch or stale. Mrs Nobbs is a mistress of all those dishes that make you think of fog and coal smoke – like Wet Nellies, Tuppenny Uprights, Treacle Billy, Jammy Devils and Distressed Pudding. They fill you up and keep the cold out. That's what they're made for. You've got to be posh to worry about healthy eatin'. Once tasted, fondly remembered."
    },
    {
      "id": "09",
      "title": "Strawberry Wobbler",
      "src": "Mrs Ogg's recipe",
      "servings": "Makes 4–6 wobblers",
      "ingredients": [
        {
          "name": "gelatine (or veggie equivalent)",
          "src": "",
          "quantity": "2–3",
          "unit": "sachets"
        },
        {
          "name": "boiling water",
          "src": "",
          "quantity": "300",
          "unit": "ml"
        },
        {
          "name": "strawberries",
          "src": "",
          "quantity": "250",
          "unit": "g"
        },
        {
          "name": "extra-thick double cream",
          "src": "",
          "quantity": "150",
          "unit": "ml"
        },
        {
          "name": "caster sugar",
          "src": "",
          "quantity": "2",
          "unit": "tablespoons (or to taste)"
        },
        {
          "name": "strawberry ice cream",
          "src": "",
          "quantity": "",
          "unit": "for serving"
        }
      ],
      "instructions": "Dissolve the gelatine in the water following the instructions on the packet and leave to cool for 10–15 minutes. Meanwhile, rinse and 'top' the strawberries, chop in half and place in a large bowl/blender. Add most of the cream – keep a little aside for decoration – and the sugar. If using a blender, whizz it all up to a milkshake consistency. Otherwise, use a potato masher and mash until smooth. When the gelatine has cooled, mix thoroughly with the strawberry mixture and pour into the champagne flutes. Chill for two hours (or until set). Gently ease the wobblers out of the glasses (using a palette knife or similar) onto a plate, and serve upended with a couple of scoops of ice cream, placed according to preference, and a drizzle of cream.",
      "notes": "How can I put this? It's pink and it wobbles. A lot of laughs at parties. You could try serving it in a bowl, but everyone will know you're not doin' it right. Editor's Note: This dish is much easier with a blender! And we've settled for the champagne flutes because the containers apparently preferred by Mrs Ogg are … well, unavailable. Well, you don't see them in the shops. Well, not the shops on the High Street, certainly … Not our High Street, anyway."
    },
    {
      "id": "10",
      "title": "Honey Mixture",
      "ingredients": [
        {
          "name": "clear honey",
          "src": "",
          "quantity": "1",
          "unit": "small jar (approx. 113g)"
        },
        {
          "name": "clean rose petals",
          "src": "",
          "quantity": "3–4",
          "unit": "finely chopped"
        },
        {
          "name": "vanilla pod or vanilla essence",
          "src": "",
          "quantity": "1 pod or 3",
          "unit": "drops"
        },
        {
          "name": "gold leaf",
          "src": "",
          "quantity": "fingernail-sized piece",
          "unit": "(optional, for decoration)"
        }
      ],
      "instructions": "Place the unopened jar of honey in a bowl of hot water for a couple of minutes to warm slightly. Remove and dry the jar. Open it and carefully stir in the remaining ingredients. Leave for at least a couple of hours for the flavours to infuse, and always shake the jar well before use."
    }
  ]
}
